return 
{
['1'] = {
    ['area'] = 1,
    ['content'] = T('找到拉古萨'),
    ['reward'] = '"1006001"',
    },
['10'] = {
    ['area'] = 2,
    ['content'] = T('投资哥本哈根到7阶'),
    ['reward'] = '"1006002"',
    },
['11'] = {
    ['area'] = 2,
    ['content'] = T('开启4处北海遗迹'),
    ['reward'] = '"1006004"',
    },
['12'] = {
    ['area'] = 3,
    ['content'] = T('投资圣乔治到5阶'),
    ['reward'] = '"1006001"',
    },
['13'] = {
    ['area'] = 3,
    ['content'] = T('得到10件非洲宝物'),
    ['reward'] = '"1006003"',
    },
['14'] = {
    ['area'] = 3,
    ['content'] = T('投资开普敦到7阶'),
    ['reward'] = '"1006002"',
    },
['15'] = {
    ['area'] = 3,
    ['content'] = T('开启3处非洲遗迹'),
    ['reward'] = '"1006005"',
    },
['16'] = {
    ['area'] = 4,
    ['content'] = T('投资卡利卡特到5阶'),
    ['reward'] = '"1006001"',
    },
['17'] = {
    ['area'] = 4,
    ['content'] = T('得到10件印度洋宝物'),
    ['reward'] = '"1006003"',
    },
['18'] = {
    ['area'] = 4,
    ['content'] = T('投资巴士拉到7阶'),
    ['reward'] = '"1006002"',
    },
['19'] = {
    ['area'] = 4,
    ['content'] = T('开启4处印度洋遗迹'),
    ['reward'] = '"1006005"',
    },
['2'] = {
    ['area'] = 1,
    ['content'] = T('找到亚速尔群岛'),
    ['reward'] = '"1006003"',
    },
['20'] = {
    ['area'] = 5,
    ['content'] = T('投资马六甲到5阶'),
    ['reward'] = '"1006001"',
    },
['21'] = {
    ['area'] = 5,
    ['content'] = T('得到10件东南亚宝物'),
    ['reward'] = '"1006003"',
    },
['22'] = {
    ['area'] = 5,
    ['content'] = T('投资泗水到7阶'),
    ['reward'] = '"1006002"',
    },
['23'] = {
    ['area'] = 5,
    ['content'] = T('开启4处东南亚遗迹'),
    ['reward'] = '"1006005"',
    },
['24'] = {
    ['area'] = 6,
    ['content'] = T('投资泉州到5阶'),
    ['reward'] = '"1006001"',
    },
['25'] = {
    ['area'] = 6,
    ['content'] = T('得到10件东亚宝物'),
    ['reward'] = '"1006002"',
    },
['26'] = {
    ['area'] = 6,
    ['content'] = T('得到4艘东亚船只'),
    ['reward'] = '"1006003"',
    },
['27'] = {
    ['area'] = 6,
    ['content'] = T('开启4处东亚遗迹'),
    ['reward'] = '"1006005"',
    },
['28'] = {
    ['area'] = 7,
    ['content'] = T('投资圣多明各到6阶'),
    ['reward'] = '"1006002"',
    },
['29'] = {
    ['area'] = 7,
    ['content'] = T('得到10件新大陆宝物'),
    ['reward'] = '"1006003"',
    },
['3'] = {
    ['area'] = 1,
    ['content'] = T('投资里斯本到5阶'),
    ['reward'] = '"1006002"',
    },
['30'] = {
    ['area'] = 7,
    ['content'] = T('投资巴拿马城到7阶'),
    ['reward'] = '"1006005"',
    },
['31'] = {
    ['area'] = 7,
    ['content'] = T('开启8处新大陆遗迹'),
    ['reward'] = '"1006005"',
    },
['4'] = {
    ['area'] = 1,
    ['content'] = T('得到20件地中海宝物'),
    ['reward'] = '"1006002"',
    },
['5'] = {
    ['area'] = 1,
    ['content'] = T('得到5艘地中海船只'),
    ['reward'] = '"1006004"',
    },
['6'] = {
    ['area'] = 1,
    ['content'] = T('开启10处地中海遗迹'),
    ['reward'] = '"1006004"',
    },
['7'] = {
    ['area'] = 2,
    ['content'] = T('投资伦敦到5阶'),
    ['reward'] = '"1006001"',
    },
['8'] = {
    ['area'] = 2,
    ['content'] = T('得到10件北海宝物'),
    ['reward'] = '"1006003"',
    },
['9'] = {
    ['area'] = 2,
    ['content'] = T('投资斯德哥尔摩到7阶'),
    ['reward'] = '"1006002"',
    },
}