return 
{
["ai_list"] = {
 
    },
["data"] = "42_jy",
["fight_type"] = 1.000000,
["freet_ai_list"] = {
    [1001] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "attack_ship",
        ["event_param"] = {
            },
        ["id"] = 1001.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "enemy_leader",
        },
    [1002] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "attack_ship",
        ["event_param"] = {
            },
        ["id"] = 1002.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "weake",
        },
    [1003] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "attack_ship",
        ["event_param"] = {
            },
        ["id"] = 1003.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "defend_leader",
        },
    [1004] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "attack_ship",
        ["event_param"] = {
            },
        ["id"] = 1004.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "as_leader",
        },
    [1005] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "attack_ship",
        ["event_param"] = {
            },
        ["id"] = 1005.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "nearest",
        },
    [1007] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 45.000000,
            },
        ["id"] = 1007.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1008] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 0.000000,
            },
        ["id"] = 1008.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1009] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "sail_to",
        ["event_param"] = {
            },
        ["id"] = 1009.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 50.000000,
            ["y"] = 50.000000,
            },
        ["target_range"] = 100.000000,
        ["target_ship"] = "",
        },
    [1010] = {
        ["ai_event"] = "set_speed_ratio",
        ["ai_time"] = 0.000000,
        ["event"] = "set_ai",
        ["event_param"] = {
            },
        ["id"] = 1010.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            [1] = 0.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1011] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 0.000000,
            },
        ["id"] = 1011.000000,
        ["next_ai"] = 1002.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1012] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "follow_leader",
        ["event_param"] = {
            },
        ["id"] = 1012.000000,
        ["next_ai"] = 1004.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1013] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = -45.000000,
            },
        ["id"] = 1013.000000,
        ["next_ai"] = 1002.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [1014] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "follow_leader",
        ["event_param"] = {
            },
        ["id"] = 1014.000000,
        ["next_ai"] = 1002.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10001] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "kill",
        ["event_param"] = {
            },
        ["id"] = 10001.000000,
        ["next_ai"] = 10001.000000,
        ["param"] = {
            ["female"] = {
                [1] = "干得漂亮！",
                [2] = "快，下一个目标！",
                [3] = "哼，美丽的焰火！",
                },
            ["male"] = {
                [1] = "干得好，伙计！",
                [2] = "呼哈！继续前进！",
                [3] = "哈哈，我喜欢这情景！",
                },
            },
        ["pos"] = {
            },
        },
    [10002] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "hp_ratio_less",
        ["event_param"] = {
            [1] = 70.000000,
            },
        ["id"] = 10002.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            ["female"] = {
                [1] = "船身受损严重，我需要援助！",
                [2] = "拼还是撤？这是一个问题",
                },
            ["male"] = {
                [1] = "舷板严重受损，危险！",
                [2] = "继续进攻！让敌人先沉没吧！",
                },
            },
        ["pos"] = {
            },
        },
    [10003] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "hp_ratio_less",
        ["event_param"] = {
            [1] = 35.000000,
            },
        ["id"] = 10003.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            ["female"] = {
                [1] = "别傻站着，快救火！",
                },
            ["male"] = {
                [1] = "着火了！保护火药舱和酒桶！",
                },
            },
        ["pos"] = {
            },
        },
    [10004] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "death",
        ["event_param"] = {
            },
        ["id"] = 10004.000000,
        ["next_ai"] = 0.000000,
        ["param"] = {
            ["female"] = {
                [1] = "我一定会回来的！",
                [2] = "不，这不可能！",
                [3] = "我需要变得更强！",
                },
            ["male"] = {
                [1] = "我绝不会就此认输！",
                [2] = "我，犯了一个错误！",
                [3] = "我会更强大！而你必将失败！",
                },
            },
        ["pos"] = {
            },
        },
    [10005] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1002.000000,
            },
        ["id"] = 10005.000000,
        ["next_ai"] = 10005.000000,
        ["param"] = {
            ["female"] = {
                [1] = "进入射程了，所有火炮准备，开火！",
                },
            ["male"] = {
                [1] = "机会来了！瞄准！开火！",
                },
            },
        ["pos"] = {
            },
        },
    [10006] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1010.000000,
            },
        ["id"] = 10006.000000,
        ["next_ai"] = 10006.000000,
        ["param"] = {
            ["female"] = {
                [1] = "瞄准桅杆！狠狠的打！",
                },
            ["male"] = {
                [1] = "上链弹！把敌人桅杆都给我拆咯！",
                },
            },
        ["pos"] = {
            },
        },
    [10007] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1018.000000,
            },
        ["id"] = 10007.000000,
        ["next_ai"] = 10007.000000,
        ["param"] = {
            ["female"] = {
                [1] = "拔出武器，到敌人甲板上解决他们！",
                },
            ["male"] = {
                [1] = "抓紧绳索荡过去！呼哈！",
                },
            },
        ["pos"] = {
            },
        },
    [10008] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1026.000000,
            },
        ["id"] = 10008.000000,
        ["next_ai"] = 10008.000000,
        ["param"] = {
            ["female"] = {
                [1] = "勾住他们，笨蛋！",
                },
            ["male"] = {
                [1] = "抛出钩索别让他们逃了，蠢货们！",
                },
            },
        ["pos"] = {
            },
        },
    [10009] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1030.000000,
            },
        ["id"] = 10009.000000,
        ["next_ai"] = 10009.000000,
        ["param"] = {
            ["female"] = {
                [1] = "到舷墙边举起护板，给我顶住！",
                },
            ["male"] = {
                [1] = "举高护板保护船舷！把脑袋缩回去！",
                },
            },
        ["pos"] = {
            },
        },
    [10010] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1006.000000,
            },
        ["id"] = 10010.000000,
        ["next_ai"] = 10010.000000,
        ["param"] = {
            ["female"] = {
                [1] = "堵住漏洞！用脑子或身子！快！",
                },
            ["male"] = {
                [1] = "堵好漏洞！不，放开那个酒桶！笨蛋！",
                },
            },
        ["pos"] = {
            },
        },
    [10011] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1034.000000,
            },
        ["id"] = 10011.000000,
        ["next_ai"] = 10011.000000,
        ["param"] = {
            ["female"] = {
                [1] = "满舵，下锚，避开攻击！",
                },
            ["male"] = {
                [1] = "危险！注意回避！",
                },
            },
        ["pos"] = {
            },
        },
    [10012] = {
        ["ai_event"] = "battle_slogan",
        ["event"] = "use_skill",
        ["event_param"] = {
            [1] = 1038.000000,
            },
        ["id"] = 10012.000000,
        ["next_ai"] = 10012.000000,
        ["param"] = {
            ["female"] = {
                [1] = "让侧舷吃足风力，全速前进！",
                },
            ["male"] = {
                [1] = "满帆受风，下桨，全速前进！",
                },
            },
        ["pos"] = {
            },
        },
    [10061] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 30.000000,
            },
        ["id"] = 10061.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10062] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 20.000000,
            },
        ["id"] = 10062.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10063] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 0.000000,
            },
        ["id"] = 10063.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10064] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = -20.000000,
            },
        ["id"] = 10064.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10065] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = -30.000000,
            },
        ["id"] = 10065.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10071] = {
        ["ai_event"] = "del_ai",
        ["ai_time"] = 0.000000,
        ["event"] = "enterFire",
        ["event_param"] = {
            },
        ["id"] = 10071.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            [1] = 1007.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10101] = {
        ["ai_event"] = "set_speed_ratio",
        ["ai_time"] = 0.000000,
        ["event"] = "beLeaderHit",
        ["event_param"] = {
            },
        ["id"] = 10101.000000,
        ["next_ai"] = 10103.000000,
        ["param"] = {
            [1] = 100.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "role_leader",
        },
    [10102] = {
        ["ai_event"] = "",
        ["ai_time"] = 0.000000,
        ["event"] = "enterFire",
        ["event_param"] = {
            },
        ["id"] = 10102.000000,
        ["next_ai"] = 1005.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10103] = {
        ["ai_event"] = "del_ai",
        ["ai_time"] = 0.000000,
        ["event"] = "set_ai",
        ["event_param"] = {
            },
        ["id"] = 10103.000000,
        ["next_ai"] = 1001.000000,
        ["param"] = {
            [1] = 10102.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10111] = {
        ["ai_event"] = "del_ai",
        ["ai_time"] = 0.000000,
        ["event"] = "enterFire",
        ["event_param"] = {
            },
        ["id"] = 10111.000000,
        ["next_ai"] = 1002.000000,
        ["param"] = {
            [1] = 1011.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10121] = {
        ["ai_event"] = "del_ai",
        ["ai_time"] = 0.000000,
        ["event"] = "enterFire",
        ["event_param"] = {
            },
        ["id"] = 10121.000000,
        ["next_ai"] = 1004.000000,
        ["param"] = {
            [1] = 1012.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10131] = {
        ["ai_event"] = "",
        ["ai_time"] = 10.000000,
        ["event"] = "sail_dir",
        ["event_param"] = {
            [1] = 45.000000,
            },
        ["id"] = 10131.000000,
        ["next_ai"] = 1001.000000,
        ["param"] = {
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    [10141] = {
        ["ai_event"] = "del_ai",
        ["ai_time"] = 0.000000,
        ["event"] = "enterFire",
        ["event_param"] = {
            },
        ["id"] = 10141.000000,
        ["next_ai"] = 1002.000000,
        ["param"] = {
            [1] = 1014.000000,
            },
        ["pos"] = {
            ["x"] = 0.000000,
            ["y"] = 0.000000,
            },
        ["target_range"] = 0.000000,
        ["target_ship"] = "",
        },
    },
["info"] = {
    ["battleId"] = 4.000000,
    ["battleSid"] = 2.000000,
    ["realId"] = 42.000000,
    },
["isRepeatable"] = false,
["layerId"] = 6.000000,
["plot"] = {
    [1] = {
        ["param"] = {
            [1] = {
                [1] = 494.000000,
                [2] = 600.000000,
                [3] = 0.000000,
                },
            [2] = {
                [1] = 1674.000000,
                [2] = 636.000000,
                [3] = 2.000000,
                },
            },
        ["plot"] = "camera",
        },
    [2] = {
        ["param"] = {
            [1] = 0.000000,
            [2] = "",
            [3] = 1.000000,
            [4] = "又是维京海盗！他们正在抢劫手无寸铁的商船！",
            ["ship_id"] = 1.000000,
            },
        ["plot"] = "dialog",
        },
    [3] = {
        ["param"] = {
            [1] = 0.000000,
            [2] = "",
            [3] = 1.000000,
            [4] = "我们必须给他们一个教训。",
            ["ship_id"] = 1.000000,
            },
        ["plot"] = "dialog",
        },
    },
["reward"] = {
    ["exp"] = "38",
    ["silver"] = "2100",
    },
["session"] = "10005:1446530807",
["ships"] = {
    [1] = {
        ["ai_id"] = {
            [1] = 1.000000,
            [2] = 12.000000,
            [3] = 22.000000,
            [4] = 24.000000,
            [5] = 25.000000,
            [6] = 32.000000,
            },
        ["arena"] = 0.000000,
        ["attr"] = {
            ["far_equip"] = {
                [1] = {
                    ["amount"] = 1.000000,
                    ["power"] = 10.800000,
                    ["range"] = 431.000000,
                    ["target_hit"] = 100.000000,
                    ["type"] = 2.000000,
                    },
                },
            ["max_hp"] = 312.000000,
            ["near"] = 9.700000,
            ["ship_defense"] = 9.500000,
            ["speed"] = 0.800000,
            },
        ["baowus"] = {
            },
        ["boatTransStar"] = 2.000000,
        ["boat_load"] = 0.000000,
        ["cash"] = 0.000000,
        ["fighter_name"] = "加里金尼",
        ["fighter_type"] = "player",
        ["fleet_dir"] = 3.000000,
        ["formationId"] = 1.000000,
        ["formationPos"] = 1.000000,
        ["goods"] = {
            },
        ["head_id"] = 1.000000,
        ["honour"] = 2000.000000,
        ["id"] = 1.000000,
        ["isFormation"] = true,
        ["is_boss"] = 0.000000,
        ["is_enter"] = true,
        ["is_leader"] = true,
        ["is_need_extra_light"] = 0.000000,
        ["is_player"] = true,
        ["is_uid"] = true,
        ["level"] = 50.000000,
        ["name"] = "轻型三角帆船",
        ["new_ai_id"] = {
            },
        ["plunder"] = 0.000000,
        ["plunder_point"] = 300.000000,
        ["pos"] = {
            ["rota"] = 3.000000,
            ["x"] = 344.000000,
            ["y"] = 600.000000,
            },
        ["prop_id"] = 0.000000,
        ["radar_show"] = true,
        ["role"] = 0.000000,
        ["sailor_id"] = 60.000000,
        ["ship_id"] = 1.000000,
        ["skill_rate"] = 1.000000,
        ["skills"] = {
            [1010] = 1.000000,
            [1014] = 1.000000,
            [1017] = 1.000000,
            [1018] = 1.000000,
            [1022] = 1.000000,
            [1025] = 1.000000,
            [1030] = 1.000000,
            [1032] = 1.000000,
            [1038] = 1.000000,
            [1042] = 1.000000,
            [1054] = 1.000000,
            [1066] = 1.000000,
            [1078] = 1.000000,
            [1079] = 1.000000,
            [1082] = 1.000000,
            [1086] = 1.000000,
            [1087] = 1.000000,
            [1098] = 1.000000,
            [1099] = 1.000000,
            [1102] = 1.000000,
            [1103] = 1.000000,
            [1106] = 1.000000,
            [1110] = 1.000000,
            [1111] = 1.000000,
            [1124] = 1.000000,
            [1134] = 1.000000,
            [1204] = 1.000000,
            [1208] = 1.000000,
            [1214] = 1.000000,
            [1402] = 1.000000,
            },
        ["sort"] = "soldier",
        ["tag"] = "玩家",
        ["team_id"] = 1.000000,
        ["uid"] = 10005.000000,
        ["walk_Id"] = 3.000000,
        },
    [2] = {
        ["ai_id"] = {
            [1] = 15.000000,
            [2] = 17.000000,
            [3] = 20.000000,
            [4] = 21.000000,
            [5] = 26.000000,
            },
        ["arena"] = 0.000000,
        ["attr"] = {
            ["far_equip"] = {
                [1] = {
                    ["amount"] = 2.000000,
                    ["power"] = 0.000000,
                    ["range"] = 315.000000,
                    ["target_hit"] = 100.000000,
                    },
                },
            ["max_hp"] = 1123.000000,
            ["near"] = 0.000000,
            ["ship_defense"] = 42.000000,
            ["speed"] = 0.000000,
            },
        ["baowus"] = {
            },
        ["boatTransStar"] = 0.000000,
        ["boat_load"] = 0.000000,
        ["fighter_name"] = "维京掠夺者",
        ["goods"] = {
            },
        ["head_id"] = 2.000000,
        ["id"] = 2.000000,
        ["isFormation"] = false,
        ["is_boss"] = 0.000000,
        ["is_enter"] = true,
        ["is_leader"] = true,
        ["is_need_extra_light"] = 0.000000,
        ["is_player"] = false,
        ["level"] = 14.000000,
        ["name"] = "维京掠夺者",
        ["new_ai_id"] = {
            [1] = "sys_clear",
            },
        ["plunder"] = 0.000000,
        ["plunder_point"] = 0.000000,
        ["pos"] = {
            ["rota"] = 6.000000,
            ["x"] = 1926.000000,
            ["y"] = 586.000000,
            },
        ["prop_id"] = 0.000000,
        ["radar_show"] = true,
        ["role"] = 0.000000,
        ["sailor_id"] = 38.000000,
        ["ship_id"] = 3.000000,
        ["skill_rate"] = 1.000000,
        ["skills"] = {
            },
        ["sort"] = "soldier",
        ["tag"] = "敌1",
        ["team_id"] = 2.000000,
        ["uid"] = 0.000000,
        ["walk_Id"] = 1.000000,
        },
    },
}