return 
{
[1] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成地中海的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-红胡子'),
    ['title'] = T('任务'),
    },
[2] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【海上牧民】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-海上牧民'),
    ['title'] = T('战役'),
    },
[3] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('我们在地中海还有未解锁的港口,'),
        [2] = T('#【出海】'),
        [3] = T('后到处逛逛吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ports',
        },
    ['text'] = T('解锁12座地中海港口'),
    ['title'] = T('港口'),
    },
[4] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【比萨】'),
        [2] = T('是水手聚集地，去那里招募新伙伴吧。'),
        [3] = '',
        },
    ['ports'] = {
        [1] = 9,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        },
    ['text'] = T('招募9名地中海水手'),
    ['title'] = T('水手'),
    },
[5] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【巴塞罗那】'),
        [2] = T('有闻名地中海的造船厂，我们可以在那里建造新船。'),
        [3] = '',
        },
    ['ports'] = {
        [1] = 6,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ship',
        },
    ['text'] = T('获得武装帆船'),
    ['title'] = T('船只'),
    },
[6] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【爱琴海主人】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-爱琴海主人'),
    ['title'] = T('战役'),
    },
[7] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【伊斯坦堡】'),
        [2] = T('#【亚历山大】'),
        [3] = T('是水手聚集地，去那里招募新伙伴吧。'),
        [4] = '',
        },
    ['ports'] = {
        [1] = 13,
        [2] = 15,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募地中海水手'),
    ['title'] = T('水手'),
    },
[8] = {
    ['chat_complete'] = {
        [1] = T('我们已经获得了最先进的战舰，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【亚历山大】'),
        [2] = T('有著名的造船厂，我们可以在那里建造新战舰。'),
        [3] = '',
        },
    ['ports'] = {
        [1] = 15,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ship',
        },
    ['text'] = T('获得三桅卡拉维尔'),
    ['title'] = T('船只'),
    },
[9] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【勒班陀海战】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-勒班托海战'),
    ['title'] = T('战役'),
    },
[10] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[11] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[12] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募地中海水手'),
    ['title'] = T('水手'),
    },
[13] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[14] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[15] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('要想成为地中海霸主必须经过最后的考验，完成战役'),
        [2] = T('#【地中海霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役地中海霸主'),
    ['title'] = T('霸主'),
    },
[16] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[17] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[18] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成北海的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-冷酷的航线'),
    ['title'] = T('任务'),
    },
[19] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【危险龙头船】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-危险龙头船'),
    ['title'] = T('战役'),
    },
[20] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('我们在北海还有未解锁的港口,'),
        [2] = T('#【出海】'),
        [3] = T('后到处逛逛吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ports',
        },
    ['text'] = T('解锁北海所有港口'),
    ['title'] = T('港口'),
    },
[21] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【汉堡】'),
        [2] = T('有著名的造船厂，我们可以在那里建造新战舰。'),
        [3] = '',
        },
    ['ports'] = {
        [1] = 22,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ship',
        },
    ['text'] = T('获得汉萨排桨商船'),
    ['title'] = T('船只'),
    },
[22] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【汉萨同盟】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-汉萨同盟'),
    ['title'] = T('战役'),
    },
[23] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【伦敦】'),
        [2] = T('和'),
        [3] = T('#【斯德哥尔摩】'),
        [4] = T('是水手聚集地，我们去那里招募新伙伴吧。'),
        [5] = '',
        },
    ['ports'] = {
        [1] = 20,
        [2] = 28,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募2名北海水手'),
    ['title'] = T('水手'),
    },
[24] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('投资不同类型的港口会获得不同的利益，去'),
        [2] = T('#【市政厅】'),
        [3] = T('看看吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'town',
        },
    ['text'] = T('投资2阶北海港口4座'),
    ['title'] = T('投资'),
    },
[25] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【英西海战】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-英西海战'),
    ['title'] = T('战役'),
    },
[26] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[27] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[28] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募4名北海水手'),
    ['title'] = T('水手'),
    },
[29] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[30] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[31] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('与德雷克争夺北海霸主的最后荣耀吧，完成战役'),
        [2] = T('#【北海霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-北海霸主'),
    ['title'] = T('霸主'),
    },
[32] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[33] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[34] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成非洲的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-魔鬼之手'),
    ['title'] = T('任务'),
    },
[35] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【黄金商路】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-黄金商路'),
    ['title'] = T('战役'),
    },
[36] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('我们在非洲还有未解锁的港口,'),
        [2] = T('#【出海】'),
        [3] = T('后到处逛逛吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ports',
        },
    ['text'] = T('解锁非洲所有港口'),
    ['title'] = T('港口'),
    },
[37] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[38] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【三角贸易王】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-三角贸易王'),
    ['title'] = T('战役'),
    },
[39] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【圣乔治】'),
        [2] = T('和'),
        [3] = T('#【开普敦】'),
        [4] = T('是水手聚集地，我们去那里招募新伙伴吧。'),
        [5] = '',
        },
    ['ports'] = {
        [1] = 32,
        [2] = 35,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募非洲水手'),
    ['title'] = T('水手'),
    },
[40] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('投资不同类型的港口会获得不同的利益，去'),
        [2] = T('#【市政厅】'),
        [3] = T('看看吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'town',
        },
    ['text'] = T('投资3阶非洲港口3座'),
    ['title'] = T('投资'),
    },
[41] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【基德船长】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-基德船长'),
    ['title'] = T('战役'),
    },
[42] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[43] = {
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[44] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募非洲水手'),
    ['title'] = T('水手'),
    },
[45] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[46] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[47] = {
    ['chat_guide'] = {
        [1] = T('黑色准男爵是非洲的梦魇，终结这一切吧，完成战役'),
        [2] = T('#【黑色准男爵】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 50,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-黑色准男爵'),
    ['title'] = T('霸主'),
    },
[48] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[49] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[50] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成印度洋的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-占领果阿'),
    ['title'] = T('任务'),
    },
[51] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【哭泣的果阿】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-哭泣的果阿'),
    ['title'] = T('战役'),
    },
[52] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('我们在印度洋还有未解锁的港口,'),
        [2] = T('#【出海】'),
        [3] = T('后到处逛逛吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ports',
        },
    ['text'] = T('解锁印度洋所有港口'),
    ['title'] = T('港口'),
    },
[53] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【巴士拉】'),
        [2] = T('有著名的造船厂，我们可以在那里建造新战舰。'),
        [3] = '',
        },
    ['ports'] = {
        [1] = 45,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ship',
        },
    ['text'] = T('获得阿拉伯桨帆船'),
    ['title'] = T('船只'),
    },
[54] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【达伽马】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-达伽马'),
    ['title'] = T('战役'),
    },
[55] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【巴士拉】'),
        [2] = T('和'),
        [3] = T('#【麦加】'),
        [4] = T('是水手聚集地，我们去那里招募新伙伴吧。'),
        [5] = '',
        },
    ['ports'] = {
        [1] = 45,
        [2] = 42,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募印度洋水手'),
    ['title'] = T('水手'),
    },
[56] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('投资不同类型的港口会获得不同的利益，去'),
        [2] = T('#【市政厅】'),
        [3] = T('看看吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'town',
        },
    ['text'] = T('投资3阶印度洋港口4座'),
    ['title'] = T('投资'),
    },
[57] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【东印度公司】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-东印度公司'),
    ['title'] = T('战役'),
    },
[58] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[59] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[60] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募印度洋水手'),
    ['title'] = T('水手'),
    },
[61] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[62] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[63] = {
    ['chat_guide'] = {
        [1] = T('托马斯.图阴影下的印度洋需要新的希望，完成战役'),
        [2] = T('#【印度洋霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 50,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-印度洋霸主'),
    ['title'] = T('霸主'),
    },
[64] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[65] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[66] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成东南亚的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-凌晨的炮声'),
    ['title'] = T('任务'),
    },
[67] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【王冠的珍珠】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-王冠的珍珠'),
    ['title'] = T('战役'),
    },
[68] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('我们在东南亚还有未解锁的港口,'),
        [2] = T('#【出海】'),
        [3] = T('后到处逛逛吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ports',
        },
    ['text'] = T('解锁东南亚所有港口'),
    ['title'] = T('港口'),
    },
[69] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【雅加达】'),
        [2] = T('、'),
        [3] = T('#【文莱】'),
        [4] = T('和'),
        [5] = T('#【马尼拉】'),
        [6] = T('有著名的造船厂，我们可以在那里建'),
        [7] = T('造新船。'),
        },
    ['ports'] = {
        [1] = 53,
        [2] = 56,
        [3] = 58,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'ship',
        },
    ['text'] = T('获得1艘东南亚船只'),
    ['title'] = T('船只'),
    },
[70] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【潮州王】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-潮州王'),
    ['title'] = T('战役'),
    },
[71] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('#【亚齐】'),
        [2] = T('和'),
        [3] = T('#【马六甲】'),
        [4] = T('是水手聚集地，我们去那里招募新伙伴吧。'),
        [5] = '',
        },
    ['ports'] = {
        [1] = 51,
        [2] = 52,
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募东南亚水手'),
    ['title'] = T('水手'),
    },
[72] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('投资不同类型的港口会获得不同的利益，去'),
        [2] = T('#【市政厅】'),
        [3] = T('看看吧。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'town',
        },
    ['text'] = T('投资4阶东南亚港口3座'),
    ['title'] = T('投资'),
    },
[73] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【宝船之谜】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-宝船之谜'),
    ['title'] = T('战役'),
    },
[74] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[75] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[76] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募东南亚水手'),
    ['title'] = T('水手'),
    },
[77] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[78] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[79] = {
    ['chat_guide'] = {
        [1] = T('是时候向控制东南亚的红旗帮发起挑战了，完成战役'),
        [2] = T('#【东南亚霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 50,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-东南亚霸主'),
    ['title'] = T('霸主'),
    },
[80] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[81] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[82] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成东南亚的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-凌晨的炮声'),
    ['title'] = T('任务'),
    },
[83] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【屯门之战】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成战役-屯门之战'),
    ['title'] = T('战役'),
    },
[84] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = T('港口'),
    },
[85] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[86] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【净海王】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成战役-净海王'),
    ['title'] = T('战役'),
    },
[87] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[88] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[89] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【壬辰海战】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-壬辰海战'),
    ['title'] = T('战役'),
    },
[90] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[91] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[92] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募东亚水手'),
    ['title'] = T('水手'),
    },
[93] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[94] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[95] = {
    ['chat_guide'] = {
        [1] = T('张保仔已称霸南海，我们和他必有一战，完成战役'),
        [2] = T('#【东亚霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 50,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-东亚霸主'),
    ['title'] = T('霸主'),
    },
[96] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[97] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[98] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('初来乍到，先完成东南亚的【剧情任务】吧。'),
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = T('完成任务-凌晨的炮声'),
    ['title'] = T('任务'),
    },
[99] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【演说家萨姆】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-演说家萨姆'),
    ['title'] = T('战役'),
    },
[100] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = T('港口'),
    },
[101] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[102] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【残暴的魔鬼】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-残暴的魔鬼'),
    ['title'] = T('战役'),
    },
[103] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[104] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['text'] = '',
    ['title'] = '',
    },
[105] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['chat_guide'] = {
        [1] = T('有一个严峻的考验摆在我面前，完成战役'),
        [2] = T('#【踏浪姐妹花】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-踏浪姐妹花'),
    ['title'] = T('战役'),
    },
[106] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[107] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[108] = {
    ['chat_complete'] = {
        [1] = T('我们已经完成了目标，让我们去'),
        [2] = T('#【领奖】'),
        [3] = T('吧！'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 10,
        },
    ['skip_info'] = {
        [1] = 'hotel',
        [2] = 'hotel',
        },
    ['text'] = T('招募4名新大陆水手'),
    ['title'] = T('水手'),
    },
[109] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[110] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[111] = {
    ['chat_guide'] = {
        [1] = T('是时候与最后的霸者亨利.摩根决战了，完成战役'),
        [2] = T('#【新大陆霸主】'),
        [3] = T('。'),
        [4] = '',
        },
    ['reward'] = {
        ['gold'] = 50,
        },
    ['skip_info'] = {
        [1] = 'fight',
        },
    ['text'] = T('完成战役-新大陆霸主'),
    ['title'] = T('霸主'),
    },
[112] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
[113] = {
    ['reward'] = {
        },
    ['text'] = '',
    ['title'] = '',
    },
}