-- 游戏中的log状态记录


LOG_1000 = "L1000"--"启动前"
LOG_1001 = "L1001"--"动画"
LOG_1002 = "L1002"--"动画结束，开始游戏"
LOG_1003 = "L1003"--"游客选服"
LOG_1004 = "L1004"--"本地uuid为2"
LOG_1005 = "L1005"--"socket连接"
LOG_1006 = "L1006"--"socket连接成功，version发送"
LOG_1007 = "L1007"--"version返回，决定登录"
LOG_1008 = "L1008"--"check_uuid"
LOG_1009 = "L1009"--"uuid返回，决定登录状态"
LOG_1010 = "L1010"--"未绑定过登录"

LOG_1011 = "L1011"--"登录界面"
LOG_1012 = "L1012"--"游客点击"
LOG_1013 = "L1013"--"QQ点击"
LOG_1014 = "L1014"--"微信点击"
LOG_1015 = "L1015"--"账号按钮点击开始"
LOG_1016 = "L1016"--"账号按钮点击登录"

LOG_1017 = "L1017"--"绑定界面"
LOG_1018 = "L1018"--"绑定游客点击"
LOG_1019 = "L1019"--"绑定QQ点击"
LOG_1020 = "L1020"--"绑定微信点击"
LOG_1021 = "L1021"--"绑定账号按钮点击开始"
LOG_1022 = "L1022"--"绑定账号按钮点击登录"

LOG_1023 = "L1023"--"安卓授权拉起"
LOG_1024 = "L1024"--"安卓授权成功"
LOG_1025 = "L1025"--"安卓授权失败"

LOG_1030 = "L1030"--"ios拉起授权"
LOG_1031 = "L1031"--"ios授权返回成功"
LOG_1032 = "L1032"--"ios授权返回失败"

LOG_1038 = "L1038"--"换服确认"
LOG_1039 = "L1039"--"切服重连"
LOG_1040 = "L1040"--"连接到version后执行验证"
LOG_1041 = "L1041"--"发起验证"
LOG_1042 = "L1042"--"发起验证返回成功"
LOG_1043 = "L1043"--"发起验证返回失败"

LOG_1048 = "L1048"--"发起绑定"
LOG_1049 = "L1049"--"发起绑定返回成功"
LOG_1050 = "L1050"--"用老号绑定"
LOG_1051 = "L1051"--"发起绑定返回失败"

LOG_1052 = "L1052"--"发起绑定返回失败"

LOG_0001 = "L0001"--"socket关闭"
